tutorials/multiphaseTransport/interTransportFoam/channelMultiphaseTransport/system/controlDict0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interTransportFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         TotalTime;

deltaT          initTimestep;

writeControl    adjustable;

writeInterval   WriteTimestep;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           maxCourant;
maxAlphaCo      maxCourant;

maxDeltaT       maxTimestep; 

libs ("libfiniteVolumeGCFOAM.so""libreactionThermophysicalModelsGCFOAM.so");

// ************************************************************************* //
